[
    {
        "id": 1,
        "title": "Warm-up",
        "imageSrc": "",
        "content": [
            "<strong>Can you tell me your name?</strong>",
            "Khi giám khảo hỏi tên bạn, bạn chỉ cần trả lời ngắn gọn là <strong>My name is... </strong>,<span style=\"color: red; font-weight: bold;\">không cần nói thêm dài dòng</span>. Tuy nhiên ở bài đầu tiên này, chúng ta sẽ làm quen với việc phát triển ý để nói về một chủ đề cụ thể nào đó, ví dụ như nói về tên của bạn.",
            "Để bắt đầu, chúng ta hãy cùng phân tích một mẫu câu sau:",
            "<span style=\"color: red; font-weight: bold; font-size:35px; display: inline-block; text-align: center;\">My name is ... , which means ... and ... . ... chose it because ... .</span>",
            "Nhìn vào mẫu câu này, chúng ta có thể thấy nó gồm có 4 ý: tên là gì, nghĩa là gì, ai đặt tên, lý do đặt tên. Bốn ý này được thể hiện qua 2 câu bằng cách sử dụng đại từ quan hệ và liên từ.",
            "<strong>Sentence 1:</strong> My name is <span style=\"color: red; font-weight: bold;\">NAME</span>, which means <span style=\"color: red; font-weight: bold;\">NOUN</span> and <span style=\"color: red; font-weight: bold;\">NOUN</span>.",
            "Ý nghĩa: Tên tôi là TÊN, nghĩa là DANH TỪ và DANH TỪ.",
            "<strong>which means</strong> là mệnh đề quan hệ không xác định, nằm sau dấu phẩy để bổ sung ý nghĩa thêm cho toàn câu, với <span style=\"font-style: italic;\">which = The fact that my name is...</span>",
            "Bạn hãy điền tên của bạn vào phần <span style=\"color: red; font-weight: bold;\">NAME</span>",
            "Ở phần <span style=\"color: red; font-weight: bold;\">NOUN</span>, bạn có thể chọn những danh từ phổ biến về ý nghĩa tên người sau:",
            "**brightness**, **intelligence**, **elegance**, **wisdom**, **prosperity**, **abundance**, **hope**, **joy**, **peace**, **safety**, **kindness**, **virtue**, **dragon**, **strength**, **flower**, **beauty**, **bravery**, **courage**, **renewal**, **happiness**, **blessing**",
            "Example: My name is Minh, which means brightness and intelligence.",
            "<strong>Sentence 2:</strong> <span style=\"color: red; font-weight: bold;\">NAME GIVER</span> chose it because <span style=\"color: red; font-weight: bold;\">REASON FOR THE NAME</span>.",
            "Ý nghĩa: NGƯỜI ĐẶT TÊN đã chọn nó bởi vì LÝ DO ĐẶT TÊN (MỆNH ĐỀ)",
            "Sử dụng động từ choose ở quá khứ là chose vì hành động này đã xảy ra trong quá khứ",
            "Ở phần <span style=\"color: red; font-weight: bold;\">NAME GIVER</span>, bạn có thể chọn những danh từ chỉ người thân sau:",
            "**parents**, **grandparents**, **mother**, **father**, **aunt**, **uncle**, **grandfather**, **grandmother**",
            "Sau because sẽ là một mệnh đề (clause), bạn có thể chọn 3 cấu trúc sau:",
            "<span style=\"font-weight: bold; font-size:20px;\">1. S + V + O + to infinitive</span>",
            "S là subject (chủ ngữ). Ở đây, chúng ta sẽ dùng những đại từ nhân xưng như <strong>he, she, they</strong> để thay cho NAME GIVER mà bạn đã chọn.",
            "- parents/grandparents: thay bằng they",
            "- mother/aunt/grandmother: thay bằng she",
            "- father/uncle/grandfather: thay bằng he",
            "V là verb (động từ). Những động từ mà chúng ta sẽ dùng ở câu này là: <span style=\"color: red; font-weight: bold;\">WISH FOR</span>, <span style=\"color: red; font-weight: bold;\">WANT</span>, chú ý động từ chia ở thì quá khứ (thêm đuôi -ed vào sau) do hành động này đã xảy ra trong quá khứ.",
            "O là object (tân ngữ). Tân ngữ mà chúng ta sẽ dùng là <span style=\"color: red; font-weight: bold;\">ME</span>",
            "Những cụm to infinitive phrases mà chúng ta sẽ dùng để thể hiện mong muốn mà NAME GIVER muốn dành cho các bạn khi đặt tên có thể là:",
            "- to **have a bright and prosperous future**",
            "- to **grow up graceful and intelligent**",
            "- to **have a life full of joy and good fortune**",
            "- to **have a successful and fulfill life**",
            "- to **grow up to be a kind-hearted person**",
            "- to **be wise and successful in life**",
            "- to **be strong and rise above challenges in life**",
            "- to **be fearless and strong in life**",
            "- to **be strong and powerful like a dragon**",
            "- to **bring joy and charm to those around me**",
            "Example: My parents chose it because they wished for me to have a bright and prosperous future.",
            "<span style=\"font-weight: bold; font-size:20px;\">2. S + V + O + noun phrase</span>",
            "S: <strong>he, she, they</strong> để thay cho NAME GIVER mà bạn đã chọn.",
            "V: <span style=\"color: red; font-weight: bold;\">WISH</span>, chú ý động từ chia ở thì quá khứ (thêm đuôi -ed vào sau) do hành động này đã xảy ra trong quá khứ.",
            "O: <span style=\"color: red; font-weight: bold;\">ME</span>",
            "Những cụm noun phrases mà chúng ta sẽ dùng để thể hiện mong muốn mà NAME GIVER muốn dành cho các bạn khi đặt tên có thể là:",
            "- **a bright and prosperous future**",
            "- **a life full of joy and good fortune**",
            "- **a successful and fulfill life**",
            "- **a life full of happiness and tranquility**",
            "Example: My father chose it because he wished me a life full of joy and good fortune.",
            "<span style=\"font-weight: bold; font-size:20px;\">3. S1 + V1 + S2 + V2 + to infinitive</span>",
            "S1: <strong>he, she, they</strong>",
            "V2: <span style=\"color: red; font-weight: bold;\">HOPE</span>, <span style=\"color: red; font-weight: bold;\">BELIEVE</span>, chú ý động từ chia ở thì quá khứ (thêm đuôi -ed vào sau) do hành động này đã xảy ra trong quá khứ.",
            "S2: <span style=\"color: red; font-weight: bold;\">I</span>",
            "V2: <span style=\"color: red; font-weight: bold;\">WOULD</span>",
            "Những cụm to infinitive phrases mà chúng ta sẽ dùng để thể hiện mong muốn mà NAME GIVER muốn chúng ta thực hiện với cái tên đó giống với cấu trúc 1, nhưng bỏ to:",
            "- **have a bright and prosperous future**",
            "- **grow up graceful and intelligent**",
            "- **have a life full of joy and good fortune**",
            "- **have a successful and fulfill life**",
            "- **grow up to be a kind-hearted person**",
            "- **be wise and successful in life**",
            "- **be strong and rise above challenges in life**",
            "- **be fearless and strong in life**",
            "- **be strong and powerful like a dragon**",
            "- **bring joy and charm to those around me**",
            "Example: My grandmother chose it because she believed I would grow up graceful and intelligent."

        ]
    },
    {
        "id": 2,
        "title": "As computers are being used more and more in education, there will be soon no role for teachers in the classroon.",
        "imageSrc": "https://storage.googleapis.com/script60s/TRUE%20BLOOD/IMAGE/plastic-sheeting.jpg",
        "content": [
            "<span style=\"color: red; font-weight: bold;\">Minh</span>There have been immense advances in technology in most aspects of people's lives, especially in the field of education. Nowadays, an increasing number of students rely on computers to research for information and to produce a perfect paper for school purposes. Others have decided to leave the original way of learning to get knowledge through online schools. These changes in the learning process have brought a special concern regarding the possible decrease of importance of teachers in the classroom.",
            "Some people believe the role of teachers started to fade because computers have been helping some students to progress in their studies quicker than when compared with an original classroom. For example, in the same classroon, students have different intellectual capacities, thus some would be tied to a slow advance in their studies because of other's incapacity of understanding. In this way, pupils could progress in their acquisition of knowledge at their own pace using computers instead of learning from teachers.",
            "However, the presence of a teacher is essential for students because the human contact influences them in positive ways. Firstly, students realize that they are not dealing with a machine but with a human being who deserves attention and respect. They also learn the importance of studying in group and resprect other students, which helps them to improve their social skills.",
            "Moreover, teachers are required in the learning process because they acknowledge some student's deficiencies and help them to solve their problems by repeating the same explanation, giving extra exercises or even suggesting a private tutor. Hence, students can have a bigger chance not to fail in a subject.",
            "In conclusion, the role for teachers in the learning process is still very important and it will continue to be in the future because no machine can replace the human interaction and its consequences."
        ]
    }
]
