[
    {
        "id": 1,
        "title": "Warm-up",
        "imageSrc": "",
        "content": [
            "1. Can you tell me your name?",
            "My name is ... , which means ... . ... chose it because ... .",
            "Ex: My name is <span style=\"color: red; font-weight: bold;\">Minh</span>, which means <span style=\"color: red; font-weight: bold;\">'bright' or 'intelligent' in Vietnamese</span>. <span style=\"color: red; font-weight: bold;\">My parents</span> chose it because <span style=\"color: red; font-weight: bold;\">they wanted me to be thoughtful and knowledgeable</span>.",
            "2. Where do you come from?",
            "I'm from ... , a country known for ... . ... is something I really love.",
            "Ex: I'm from <span style=\"color: red; font-weight: bold;\">Vietnam</span>, a country known for <span style=\"color: red; font-weight: bold;\">its rich history and vibrant food culture</span>. <span style=\"color: red; font-weight: bold;\">The diversity in regional cuisine</span> is something I really love.",
            "3. Tell me about your family",
            "I come from a ... family. We always ... each other, and I enjoy ... with them, especially ... .",
            "Ex: I come from a <span style=\"color: red; font-weight: bold;\">close-knit</span> family. We always <span style=\"color: red; font-weight: bold;\">support</span> each other, and I enjoy <span style=\"color: red; font-weight: bold;\">spending time</span> with them, especially <span style=\"color: red; font-weight: bold;\">during meals</span>.",
            "4. Tell me about your parents",
            "My parents are ... . They've always ... me to ..., which I really appreciate.",
            "Ex: My parents are <span style=\"color: red; font-weight: bold;\">kind and hardworking</span>. They've always <span style=\"color: red; font-weight: bold;\">encouraged</span> me to <span style=\"color: red; font-weight: bold;\">pursue my passions</span>, which I really appreciate.",
            "5. Tell me about your siblings",
            "I have ..., and we ... . ... is/are supportive and always ... me ... .",
            "Ex: I have <span style=\"color: red; font-weight: bold;\">an older sister</span>, and we <span style=\"color: red; font-weight: bold;\">get along really well</span>. <span style=\"color: red; font-weight: bold;\">She</span> is supportive and always <span style=\"color: red; font-weight: bold;\">gives</span> me <span style=\"color: red; font-weight: bold;\">great advice</span>."
        ]
    },
    {
        "id": 2,
        "title": "As computers are being used more and more in education, there will be soon no role for teachers in the classroon.",
        "imageSrc": "https://storage.googleapis.com/script60s/TRUE%20BLOOD/IMAGE/plastic-sheeting.jpg",
        "content": [
            "There have been immense advances in technology in most aspects of people's lives, especially in the field of education. Nowadays, an increasing number of students rely on computers to research for information and to produce a perfect paper for school purposes. Others have decided to leave the original way of learning to get knowledge through online schools. These changes in the learning process have brought a special concern regarding the possible decrease of importance of teachers in the classroom.",
            "Some people believe the role of teachers started to fade because computers have been helping some students to progress in their studies quicker than when compared with an original classroom. For example, in the same classroon, students have different intellectual capacities, thus some would be tied to a slow advance in their studies because of other's incapacity of understanding. In this way, pupils could progress in their acquisition of knowledge at their own pace using computers instead of learning from teachers.",
            "However, the presence of a teacher is essential for students because the human contact influences them in positive ways. Firstly, students realize that they are not dealing with a machine but with a human being who deserves attention and respect. They also learn the importance of studying in group and resprect other students, which helps them to improve their social skills.",
            "Moreover, teachers are required in the learning process because they acknowledge some student's deficiencies and help them to solve their problems by repeating the same explanation, giving extra exercises or even suggesting a private tutor. Hence, students can have a bigger chance not to fail in a subject.",
            "In conclusion, the role for teachers in the learning process is still very important and it will continue to be in the future because no machine can replace the human interaction and its consequences."
        ]
    }
]
