[
    {
        "id": 1,
        "title": "Talk about your name",
        "imageSrc": "",
        "content": [
            "Khi giám khảo hỏi tên bạn, bạn chỉ cần trả lời ngắn gọn là <strong>My name is... </strong>,<span style=\"color: red; font-weight: bold;\">không cần nói thêm dài dòng</span>. Tuy nhiên ở bài đầu tiên này, chúng ta sẽ làm quen với việc phát triển ý để nói về một chủ đề cụ thể nào đó, ví dụ như nói về tên của bạn.",
            "Để bắt đầu, chúng ta hãy cùng phân tích một mẫu câu sau:",
            "<span style=\"color: red; font-weight: bold; font-size:35px; display: inline-block; text-align: center;\">My name is ... , which means ... and ... . ... chose it because ... .</span>",
            "Nhìn vào mẫu câu này, chúng ta có thể thấy nó gồm có 4 ý: tên là gì, nghĩa là gì, ai đặt tên, lý do đặt tên. Bốn ý này được thể hiện qua 2 câu bằng cách sử dụng đại từ quan hệ và liên từ.",
            "<strong>Sentence 1:</strong> My name is <span style=\"color: red; font-weight: bold;\">NAME</span>, which means <span style=\"color: red; font-weight: bold;\">NOUN</span> and <span style=\"color: red; font-weight: bold;\">NOUN</span>.",
            "Ý nghĩa: Tên tôi là TÊN, nghĩa là DANH TỪ và DANH TỪ.",
            "<strong>which means</strong> là mệnh đề quan hệ không xác định, nằm sau dấu phẩy để bổ sung ý nghĩa thêm cho toàn câu, với <span style=\"font-style: italic;\">which = The fact that my name is...</span>",
            "Bạn hãy điền tên của bạn vào phần <span style=\"color: red; font-weight: bold;\">NAME</span>",
            "Ở phần <span style=\"color: red; font-weight: bold;\">NOUN</span>, bạn có thể chọn những danh từ phổ biến về ý nghĩa tên người sau:",
            "**brightness**, **intelligence**, **elegance**, **wisdom**, **prosperity**, **abundance**, **hope**, **joy**, **peace**, **safety**, **kindness**, **virtue**, **dragon**, **strength**, **flower**, **beauty**, **bravery**, **courage**, **renewal**, **happiness**, **blessing**",
            "Example: My name is Minh, which means brightness and intelligence.",
            "<strong>Sentence 2:</strong> <span style=\"color: red; font-weight: bold;\">NAME GIVER</span> chose it because <span style=\"color: red; font-weight: bold;\">REASON FOR THE NAME</span>.",
            "Ý nghĩa: NGƯỜI ĐẶT TÊN đã chọn nó bởi vì LÝ DO ĐẶT TÊN (MỆNH ĐỀ)",
            "Sử dụng động từ choose ở quá khứ là chose vì hành động này đã xảy ra trong quá khứ",
            "Ở phần <span style=\"color: red; font-weight: bold;\">NAME GIVER</span>, bạn có thể chọn những danh từ chỉ người thân sau:",
            "**parents**, **grandparents**, **mother**, **father**, **aunt**, **uncle**, **grandfather**, **grandmother**",
            "Sau because sẽ là một mệnh đề (clause), bạn có thể chọn 3 cấu trúc sau:",
            "<span style=\"font-weight: bold; font-size:20px;\">1. S + V + O + to infinitive</span>",
            "S là subject (chủ ngữ). Ở đây, chúng ta sẽ dùng những đại từ nhân xưng như <strong>he, she, they</strong> để thay cho NAME GIVER mà bạn đã chọn.",
            "- parents/grandparents: thay bằng they",
            "- mother/aunt/grandmother: thay bằng she",
            "- father/uncle/grandfather: thay bằng he",
            "V là verb (động từ). Những động từ mà chúng ta sẽ dùng ở câu này là: <span style=\"color: red; font-weight: bold;\">WISH FOR</span>, <span style=\"color: red; font-weight: bold;\">WANT</span>, chú ý động từ chia ở thì quá khứ (thêm đuôi -ed vào sau) do hành động này đã xảy ra trong quá khứ.",
            "O là object (tân ngữ). Tân ngữ mà chúng ta sẽ dùng là <span style=\"color: red; font-weight: bold;\">ME</span>",
            "Những cụm to infinitive phrases mà chúng ta sẽ dùng để thể hiện mong muốn mà NAME GIVER muốn dành cho các bạn khi đặt tên có thể là:",
            "- to **have a bright and prosperous future**",
            "- to **grow up graceful and intelligent**",
            "- to **have a life full of joy and good fortune**",
            "- to **have a successful and fulfill life**",
            "- to **grow up to be a kind-hearted person**",
            "- to **be wise and successful in life**",
            "- to **be strong and rise above challenges in life**",
            "- to **be fearless and strong in life**",
            "- to **be strong and powerful like a dragon**",
            "- to **bring joy and charm to those around me**",
            "Example: My parents chose it because they wished for me to have a bright and prosperous future.",
            "<span style=\"font-weight: bold; font-size:20px;\">2. S + V + O + noun phrase</span>",
            "S: <strong>he, she, they</strong> để thay cho NAME GIVER mà bạn đã chọn.",
            "V: <span style=\"color: red; font-weight: bold;\">WISH</span>, chú ý động từ chia ở thì quá khứ (thêm đuôi -ed vào sau) do hành động này đã xảy ra trong quá khứ.",
            "O: <span style=\"color: red; font-weight: bold;\">ME</span>",
            "Những cụm noun phrases mà chúng ta sẽ dùng để thể hiện mong muốn mà NAME GIVER muốn dành cho các bạn khi đặt tên có thể là:",
            "- **a bright and prosperous future**",
            "- **a life full of joy and good fortune**",
            "- **a successful and fulfill life**",
            "- **a life full of happiness and tranquility**",
            "Example: My father chose it because he wished me a life full of joy and good fortune.",
            "<span style=\"font-weight: bold; font-size:20px;\">3. S1 + V1 + S2 + V2 + to infinitive</span>",
            "S1: <strong>he, she, they</strong>",
            "V2: <span style=\"color: red; font-weight: bold;\">HOPE</span>, <span style=\"color: red; font-weight: bold;\">BELIEVE</span>, chú ý động từ chia ở thì quá khứ (thêm đuôi -ed vào sau) do hành động này đã xảy ra trong quá khứ.",
            "S2: <span style=\"color: red; font-weight: bold;\">I</span>",
            "V2: <span style=\"color: red; font-weight: bold;\">WOULD</span>",
            "Những cụm to infinitive phrases mà chúng ta sẽ dùng để thể hiện mong muốn mà NAME GIVER muốn chúng ta thực hiện với cái tên đó giống với cấu trúc 1, nhưng bỏ to:",
            "- **have a bright and prosperous future**",
            "- **grow up graceful and intelligent**",
            "- **have a life full of joy and good fortune**",
            "- **have a successful and fulfill life**",
            "- **grow up to be a kind-hearted person**",
            "- **be wise and successful in life**",
            "- **be strong and rise above challenges in life**",
            "- **be fearless and strong in life**",
            "- **be strong and powerful like a dragon**",
            "- **bring joy and charm to those around me**",
            "Example: My grandmother chose it because she believed I would grow up graceful and intelligent."

        ]
    },
    {
        "id": 2,
        "title": "Where do you come from?",
        "imageSrc": "",
        "content": [
            "Để trả lời cho câu hỏi <strong>Where do you come from? </strong>thì chúng ta sẽ có một mẫu trả lời sau:",
            "<span style=\"color: red; font-weight: bold; font-size:35px; display: inline-block; text-align: center;\">I'm from ..., a ... known for its ... and ... . ... is/are something I really love.</span>",
            "Mẫu trả lời này gồm hai câu. Câu thứ nhất trình bày về bạn đến từ đâu và nơi đó được biết đến với những đặc điểm gì. Câu thứ hai trình bày về đặc điểm nào ở nơi đó mà bạn thích nhất.",
            "Điểm nổi bật ở hai câu này là một phương pháp giúp câu trở nên gãy gọn nhưng vẫn đầy đủ ý muốn truyền tải. Đó là cách sử dụng mệnh đề rút gọn. Phần này sẽ được trình bày sau trong quá trình phân tích từng câu.",
            "Chúng ta hãy cùng tìm hiểu câu thứ nhất.",
            "<strong>Sentence 1:</strong> I'm from <span style=\"color: red; font-weight: bold;\">PLACE NAME</span>, a <span style=\"color: red; font-weight: bold;\">PLACE TYPE</span> known for its <span style=\"color: red; font-weight: bold;\">FEATURES</span>.",
            "Ý nghĩa: Tôi đến từ TÊN ĐỊA DANH, một LOẠI HÌNH ĐỊA DANH được biết đến với ĐẶC ĐIỂM.",
            "Câu 1 gồm có 2 vế. Vế thứ nhất nói về nơi xuất thân của bạn, vế thứ hai bổ sung thêm thông tin về đặc điểm nổi bật của nơi đó.",
            "- I'm from PLACE NAME có cấu trúc là <strong>S + Vtobe + preposition + place name</strong>",
            "- Nhìn vào lưu ý bên trên, ta thấy chủ ngữ <strong>S</strong> là <strong>I</strong> nên <strong>động từ to be</strong> sử dụng ở đây sẽ là <strong>am</strong>. <strong>am</strong> ở đây có nghĩa là 'là' dùng để giới thiệu.",
            "- <strong>from</strong> là một giới từ chỉ nguồn gốc, xuất xứ và theo sau nó sẽ là tên một địa danh.",
            "Example: I'm from Vung Tau.",
            "Sau vế thứ nhất, bạn thấy sự xuất hiện của dấu phẩy "," và cụm a PLACE TYPE known for its FEATURES, cụm này nguyên bản được viết là:",
            "<span style=\"color: red; font-weight: bold;\">a PLACE TYPE which is known for its FEATURES</span>",
            "- a là một mạo từ không xác định, đứng trước danh từ số ít mà bạn không muốn cho người nghe biết cụ thể về nó",
            "- PLACE TYPE là loại địa danh. Ở đây bạn có thể dùng những danh từ chỉ loại hình địa danh như sau: **country**, **city**, **village**, **town**, **place**, **island**",
            "- which is known for its FEATURES là một mệnh đề quan hệ ở dạng bị động đã được rút gọn lại thành known for its FEATURES, chúng ta hãy cùng tìm hiểu kỹ hơn về vế này nhé!",
            "CÁCH RÚT GỌN MỆNH ĐỀ QUAN HỆ:",
            "- RELATIVE PRONOUN + S + V + O -> bỏ RELATIVE PRONOUN",
            "- RELATIVE PRONOUN + V -> bỏ RELATIVE PRONOUN, đổi V thành V-ing",
            "- RELATIVE PRONOUN + be + Vp.p -> bỏ RELATIVE PRONOUN + be, giữ lại Vp.p",
            "CÂU BỊ ĐỘNG:",
            "Câu bị động là câu mà trong đó chủ ngữ S là người hay vật nhận hoặc chịu tác động của hành động.",
            "Cấu trúc câu bị động: S + be + Vpp (by agent)",
            "Vậy với cụm WHICH IS KNOWN FOR ITS FEATURES, ta có thể thấy cấu trúc của nó là RELATIVE PRONOUN (WHICH) + BE (IS) + Vpp (KNOWN) + FOR ITS FEATURES",
            "Sau WHICH là thể bị động IS KNOWN vì địa danh mà chúng ta đang muốn giới thiệu được biết đến bởi mọi người chứ nó không tự biết thông tin đó",
            "Dựa vào CÁCH RÚT GỌN MỆNH ĐỀ QUAN HỆ thì khi rút gọn, chúng ta sẽ bỏ WHICH IS đi và giữ lại KNOWN FOR",
            "ITS là tính từ sở hữu cho các thực thể không phải người và theo sau tính từ sẽ là danh từ hoặc cụm danh từ.",
            "Đối với câu này, chúng ta có thể dùng một số cụm danh từ chỉ đặc điểm của địa phương như sau:",
            "- **ancient temples**",
            "- **bustling street food scene**",
            "- **dynamic energy**",
            "- **modern skyscrapers**",
            "- **well-preserved ancient house**",
            "- **rich biodiversity**",
            "- **beautiful beaches**",
            "- **delicious seafood**",
            "- **stunning coastline**",
            "- **historical sites**",
            "- **cool climate**",
            "- **beautiful flower gardens**",
            "- **breathtaking mountain landscapes**",
            "- **ethnic minority culture**",
            "- **rich culture**",
            "Example 1: I'm from Vietnam, a country known for its bustling street food scene and rich culture.",
            "Example 2: I'm from Vung Tau, a city known for its beautiful beaches and delicious seafood.",
            "Bây giờ, chúng ta sẽ cùng tìm hiểu câu thứ hai:",
            "<strong>Sentence 2:</strong><span style=\"color: red; font-weight: bold;\">FEATURE(S)</span> is/are something I really love.",
            "Câu này được viết đầy đủ là: FEATURES is/are something that I really love nhưng đã bị lược bỏ đại từ quan hệ THAT. Theo CÁCH RÚT GỌN MỆNH ĐỀ QUAN HỆ, vì sau RELATIVE PRONOUN là một cấu trúc SVO nên chúng ta được lược bỏ RELATIVE PRONOUN.",
            "Câu này có nghĩa là: Những hoặc một đặc điểm nào đó là thứ mà tôi rất yêu thích. Để nói về các đặc điểm đó, chúng ta có thể dùng lại những cụm danh từ đã trình bày ở câu thứ nhất hoặc thêm những cụm danh từ khác như sau:",
            "- **the street food**",
            "- **the charm of the Old Quarter**",
            "- **the vibrant nightlife**",
            "- **the charming riverside scenery**",
            "- **the peaceful beauty of the national park**",
            "- **the youthful energy and continuous development**",
            "- **the fresh seafood and the peaceful beaches**",
            "- **the fresh air and romantic scenery**",
            "- **the terraced rice fields**",
            "Example: The youthful energy and continuous development are something I really love."
            
        ]
    }
]
